# Creating a DataFrame from a Two-Dimensional List

In [3]:
import pandas as pd
import numpy as np

data = [[1, 'Alice', 23], [2, 'Bob', 30], [3, 'Charlie', 22]]
df = pd.DataFrame(data, columns=['ID', 'Name', 'Age'])
print(df)

   ID     Name  Age
0   1    Alice   23
1   2      Bob   30
2   3  Charlie   22

# Creating DataFrame from a Dictionary

In [5]:
data_dict = {
    'ID': np.array([1, 2, 3]),
    'Name': np.array(['Alice', 'Bob', 'Charlie']),
    'Age': np.array([23, 30, 22])
}
df_dict = pd.DataFrame(data_dict)
df_dict

   ID     Name  Age
0   1    Alice   23
1   2      Bob   30
2   3  Charlie   22

# Creating a DataFrame from a List of Lists

In [12]:
data_of_lists = [['Alice', 23], ['Bob', 30], ['Charlie', 22]]
df_from_lists = pd.DataFrame(data_of_lists, columns=['Name', 'Age'])
df_from_lists

      Name  Age
0    Alice   23
1      Bob   30
2  Charlie   22

# Creating a DataFrame from a List of Tuples

In [13]:
data_of_tuples = [('Alice', 23), ('Bob', 30), ('Charlie', 22)]
df_from_tuples = pd.DataFrame(data_of_tuples, columns=['Name', 'Age'])
df_from_tuples

      Name  Age
0    Alice   23
1      Bob   30
2  Charlie   22

# Creating a DataFrame from a List of Dicts

In [14]:
data_of_dicts = [{'Name': 'Alice', 'Age': 23}, {'Name': 'Bob', 'Age': 30}, {'Name': 'Charlie', 'Age': 22}]
df_from_dicts = pd.DataFrame(data_of_dicts)
df_from_dicts

      Name  Age
0    Alice   23
1      Bob   30
2  Charlie   22

# Converting a List of Nested Dictionaries into a DataFrame

In [15]:
nested_data = [
    {'Name': 'Alice', 'Info': {'Age': 23, 'City': 'New York'}},
    {'Name': 'Bob', 'Info': {'Age': 30, 'City': 'Los Angeles'}}
]
df_nested = pd.json_normalize(nested_data)
df_nested

    Name  Info.Age    Info.City
0  Alice        23     New York
1    Bob        30  Los Angeles

# Replacing Values in a DataFrame Using Regex

In [17]:
df['Name'] = df['Name'].str.replace(r'A.*', 'Anonymous', regex=True)
df

   ID       Name  Age
0   1  Anonymous   23
1   2        Bob   30
2   3    Charlie   22

# Constructing a DataFrame Using String Data

In [19]:
string_data = {'Name': ['Alice', 'Bob'], 'Age': ['23', '30']}
df_string = pd.DataFrame(string_data)
df_string['Age'] = df_string['Age'].astype(int) 
df_string

    Name  Age
0  Alice   23
1    Bob   30

# Reshaping a DataFrame Using Melt

In [20]:
df_scores = pd.DataFrame({
    'Name': ['Alice', 'Bob'],
    'Math': [90, 80],
    'Science': [85, 75]
})
melted_df = pd.melt(df_scores, id_vars=['Name'], var_name='Subject', value_name='Score')
melted_df

    Name  Subject  Score
0  Alice     Math     90
1    Bob     Math     80
2  Alice  Science     85
3    Bob  Science     75